src/cf/Documents/РеализацияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>РеализацияУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаОтЗаказчика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтложенныеВзаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаОтЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/РеализацияУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = 
		СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Дата КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.РеализацияУслуг КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуг.Ссылка КАК Ссылка,
	|	ТаблицаУслуг.Услуга КАК Услуга,
	|	ТаблицаУслуг.Сумма КАК Сумма,
	|	ТаблицаУслуг.СуммаУпр КАК СуммаУпр,
	|	ТаблицаУслуг.Перевозка КАК Перевозка,
	|	ТаблицаУслуг.Заявка КАК Заявка
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.РеализацияУслуг.Услуги КАК ТаблицаУслуг
	|ГДЕ
	|	ТаблицаУслуг.Ссылка = &Ссылка";

	Запрос.Выполнить();
	
	ПодготовитьТаблицуОтложенныеВзаиморасчеты(Запрос, СтруктураДополнительныеСвойства); 
	ПодготовитьТаблицуВзаиморасчетыСКонтрагентами(Запрос, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеТаблицДляПроведения

Процедура ПодготовитьТаблицуОтложенныеВзаиморасчеты(Запрос, СтруктураДополнительныеСвойства)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Период КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Услуги.Перевозка КАК Перевозка,
	|	Услуги.Заявка КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация,
	|	СУММА(Услуги.Сумма) КАК Сумма,
	|	СУММА(Услуги.СуммаУпр) КАК СуммаУпр,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО Док.Ссылка = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Услуги.Заявка,
	|	Услуги.Перевозка,
	|	Док.Организация,
	|	Док.Контрагент,
	|	Док.Период,
	|	Док.Валюта";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтложенныеВзаиморасчеты", 
		Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры  

Процедура ПодготовитьТаблицуВзаиморасчетыСКонтрагентами(Запрос, СтруктураДополнительныеСвойства)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Период КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Услуги.Перевозка КАК Перевозка,
	|	Док.Ссылка КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация,
	|	СУММА(Услуги.Сумма) КАК Сумма,
	|	СУММА(Услуги.СуммаУпр) КАК СуммаУпр,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО Док.Ссылка = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка,
	|	Услуги.Перевозка,
	|	Док.Организация,
	|	Док.Контрагент,
	|	Док.Период,
	|	Док.Валюта";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", 
		Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
